app/views/devise/registrations/new.html.erb

    <%= f.label :department %><br />
     <%= f.collection_select(:department_id, Department.all, :id, :department_name, prompt: "Select a category") %>
---
SELECT "departments".* FROM "departments"

    <%= f.label :Employee %><br />
     <%= f.collection_select(:employee_type_id, EmployeeType.all, :id, :emp_type, prompt: "Select a employee") %>
---
SELECT "employee_types".* FROM "employee_types"