app/admin/leave_requests.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---


    column :User do |obj|
      user = User.find_by(id: obj.user_id)