app/admin/users.rb

SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "employee_types".* FROM "employee_types" WHERE "employee_types"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    column :contact
    column :address
    column :department_id do |obj|
      department = Department.find_by(id: obj.department_id)
      department.department_name if department
    end
    column :EmployeeTypes do |obj|
      EmployeeType.find(obj.employee_type_id).emp_type

SELECT "departments".* FROM "departments" WHERE "departments"."department_name" != ?  [["department_name", "admin"]]
SELECT "employee_types".* FROM "employee_types" WHERE "employee_types"."emp_type" != ?  [["emp_type", "admin"]]
---

      f.input :contact
      f.input :address
      f.input :department, as: :select, collection: Department.where.not(department_name: 'admin').map{ |a| [a.department_name, a.id] }
      f.input :employee_type, as: :select, collection: EmployeeType.where.not(emp_type: 'admin').map{ |a| [a.emp_type, a.id] }