app/views/leave_requests/_form.html.erb

SELECT "leavetypes".* FROM "leavetypes"
---
    <%= form.label :leavetype %>
    <%= form.collection_select :leavetype_id, Leavetype.all, :id, :leave_type, prompt: "Select a Leavetype" %>