app/controllers/employees_controller.rb

  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save
---
INSERT INTO "employees" ("name", "contact", "address", "department_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "nitish"], ["contact", "9908978988"], ["address", "Dewas"], ["department_id", 1], ["created_at", "2023-11-08 05:52:17.285092"], ["updated_at", "2023-11-08 05:52:17.285092"]]