app/controllers/leave_requests_controller.rb

INSERT INTO "leave_requests" ("start_date", "end_date", "status", "leavetype_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["start_date", "2023-11-09"], ["end_date", "2023-11-10"], ["status", "true"], ["leavetype_id", 1], ["created_at", "2023-11-09 10:55:17.833735"], ["updated_at", "2023-11-09 10:55:17.833735"]]
---
  def create
    @leave_request = LeaveRequest.new(leave_request_params)
    @leave_request.user_id = current_user.id
    if @leave_request.save

SELECT "leave_requests".* FROM "leave_requests" WHERE "leave_requests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_leave_request
    @leave_request = LeaveRequest.find(params[:id])