app/controllers/payments_controller.rb

SELECT "payments".* FROM "payments" WHERE "payments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_payment
      @payment = Payment.find(params[:id])